src/Catalogs/ШаблоныТекстаРеквизитовОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныТекстаРеквизитовОбследований</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодчиненРеквизиту</Name>
					<Comment>Подчинен реквизиту обследования</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненДиагнозу</Name>
					<Comment>Подчинение в разрезе диагноза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор текстового шаблона</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныТекстаРеквизитовОбследований/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(Параметры.Основание) Тогда
		Параметры.Основание.Свойство("ОкрытИзСписка", ОткрытаИзСписка);
	КонецЕсли;
	Элементы.ПодчиненРеквизиту.Видимость = НЕ ОткрытаИзСписка;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры 

&НаКлиенте
// Обработчик перед записью на клиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	
	Объект.Наименование = Объект.ТекстШаблона;//?(СтрДлина(Объект.ТекстШаблона) > 25,Лев(Объект.ТекстШаблона,20) + "...",Объект.ТекстШаблона);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

 &НаСервере
// Функция скрывает не основные элементы
//
Процедура СкрытьНеОсновныеЭлементы() Экспорт  
	
	Элементы.Родитель.Видимость          = Ложь;
	Элементы.ПодчиненРеквизиту.Видимость = Ложь;
	Элементы.ПодчиненДиагнозу.Видимость  = Ложь;  
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодчиненДиагнозуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ФормаШаблоновТекстовыхРеквизитов", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыборДиагноза", ЭтотОбъект);	
	ОткрытьФорму("Справочник.Диагнозы.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

 &НаКлиенте
Процедура НачатьВыборДиагноза(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПодчиненДиагнозу = Результат;  
 	
КонецПроцедуры


#КонецОбласти
